02. CLICON/eurekabank_consola/build/classes/META-INF/wsdl/10.40.16.190_8094/ec.edu.monster.controlador/MovimientoController.svc.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="MovimientoController" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://tempuri.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsdl:types><xsd:schema targetNamespace="http://tempuri.org/Imports"><xsd:import schemaLocation="http://10.40.16.190:8094/ec.edu.monster.controlador/MovimientoController.svc?xsd=xsd0" namespace="http://tempuri.org/"/><xsd:import schemaLocation="http://10.40.16.190:8094/ec.edu.monster.controlador/MovimientoController.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="http://10.40.16.190:8094/ec.edu.monster.controlador/MovimientoController.svc?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/ec.edu.monster.modelo"/></xsd:schema></wsdl:types><wsdl:message name="IMovimientoController_ObtenerPorCuenta_InputMessage"><wsdl:part name="parameters" element="tns:ObtenerPorCuenta"/></wsdl:message><wsdl:message name="IMovimientoController_ObtenerPorCuenta_OutputMessage"><wsdl:part name="parameters" element="tns:ObtenerPorCuentaResponse"/></wsdl:message><wsdl:message name="IMovimientoController_RegistrarDeposito_InputMessage"><wsdl:part name="parameters" element="tns:RegistrarDeposito"/></wsdl:message><wsdl:message name="IMovimientoController_RegistrarDeposito_OutputMessage"><wsdl:part name="parameters" element="tns:RegistrarDepositoResponse"/></wsdl:message><wsdl:message name="IMovimientoController_RegistrarRetiro_InputMessage"><wsdl:part name="parameters" element="tns:RegistrarRetiro"/></wsdl:message><wsdl:message name="IMovimientoController_RegistrarRetiro_OutputMessage"><wsdl:part name="parameters" element="tns:RegistrarRetiroResponse"/></wsdl:message><wsdl:message name="IMovimientoController_RegistrarTransferencia_InputMessage"><wsdl:part name="parameters" element="tns:RegistrarTransferencia"/></wsdl:message><wsdl:message name="IMovimientoController_RegistrarTransferencia_OutputMessage"><wsdl:part name="parameters" element="tns:RegistrarTransferenciaResponse"/></wsdl:message><wsdl:message name="IMovimientoController_Login_InputMessage"><wsdl:part name="parameters" element="tns:Login"/></wsdl:message><wsdl:message name="IMovimientoController_Login_OutputMessage"><wsdl:part name="parameters" element="tns:LoginResponse"/></wsdl:message><wsdl:portType name="IMovimientoController"><wsdl:operation name="ObtenerPorCuenta"><wsdl:input wsaw:Action="http://tempuri.org/IMovimientoController/ObtenerPorCuenta" message="tns:IMovimientoController_ObtenerPorCuenta_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMovimientoController/ObtenerPorCuentaResponse" message="tns:IMovimientoController_ObtenerPorCuenta_OutputMessage"/></wsdl:operation><wsdl:operation name="RegistrarDeposito"><wsdl:input wsaw:Action="http://tempuri.org/IMovimientoController/RegistrarDeposito" message="tns:IMovimientoController_RegistrarDeposito_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMovimientoController/RegistrarDepositoResponse" message="tns:IMovimientoController_RegistrarDeposito_OutputMessage"/></wsdl:operation><wsdl:operation name="RegistrarRetiro"><wsdl:input wsaw:Action="http://tempuri.org/IMovimientoController/RegistrarRetiro" message="tns:IMovimientoController_RegistrarRetiro_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMovimientoController/RegistrarRetiroResponse" message="tns:IMovimientoController_RegistrarRetiro_OutputMessage"/></wsdl:operation><wsdl:operation name="RegistrarTransferencia"><wsdl:input wsaw:Action="http://tempuri.org/IMovimientoController/RegistrarTransferencia" message="tns:IMovimientoController_RegistrarTransferencia_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMovimientoController/RegistrarTransferenciaResponse" message="tns:IMovimientoController_RegistrarTransferencia_OutputMessage"/></wsdl:operation><wsdl:operation name="Login"><wsdl:input wsaw:Action="http://tempuri.org/IMovimientoController/Login" message="tns:IMovimientoController_Login_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMovimientoController/LoginResponse" message="tns:IMovimientoController_Login_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IMovimientoController" type="tns:IMovimientoController"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="ObtenerPorCuenta"><soap:operation soapAction="http://tempuri.org/IMovimientoController/ObtenerPorCuenta" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="RegistrarDeposito"><soap:operation soapAction="http://tempuri.org/IMovimientoController/RegistrarDeposito" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="RegistrarRetiro"><soap:operation soapAction="http://tempuri.org/IMovimientoController/RegistrarRetiro" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="RegistrarTransferencia"><soap:operation soapAction="http://tempuri.org/IMovimientoController/RegistrarTransferencia" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="Login"><soap:operation soapAction="http://tempuri.org/IMovimientoController/Login" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="MovimientoController"><wsdl:port name="BasicHttpBinding_IMovimientoController" binding="tns:BasicHttpBinding_IMovimientoController"><soap:address location="http://10.40.16.190:8094/ec.edu.monster.controlador/MovimientoController.svc"/></wsdl:port></wsdl:service></wsdl:definitions>